# Work With Different Formats

### CSV

In [1]:
import pandas as pd

In [3]:
pr = pd.read_csv("products.csv")
pr

            Artist                      Album  Released    Length
0  Michael Jackson                   Thriller      1982  00:42:19
1            AC/DC              Back in Black      1980  00:42:11
2       Pink Floyd  The Dark Side of the Moon      1973  00:42:49
3  Whitney Houston              The Bodyguard      1992  00:57:44
4        Meat Loaf            Bat Out of Hell      1977  00:46:33

In [8]:
pr_order = pr.sort_values(by="Released", ascending=False)
print(pr_order)

            Artist                      Album  Released    Length
3  Whitney Houston              The Bodyguard      1992  00:57:44
0  Michael Jackson                   Thriller      1982  00:42:19
1            AC/DC              Back in Black      1980  00:42:11
4        Meat Loaf            Bat Out of Hell      1977  00:46:33
2       Pink Floyd  The Dark Side of the Moon      1973  00:42:49

In [9]:
top2 = pr.sort_values(by="Released", ascending=False).head(2)
top2

            Artist          Album  Released    Length
3  Whitney Houston  The Bodyguard      1992  00:57:44
0  Michael Jackson       Thriller      1982  00:42:19

In [12]:
top1980 = pr[pr["Released"] >= 1980]
top1980

            Artist          Album  Released    Length
0  Michael Jackson       Thriller      1982  00:42:19
1            AC/DC  Back in Black      1980  00:42:11
3  Whitney Houston  The Bodyguard      1992  00:57:44

In [13]:
pr.to_csv("singers.csv", index=False)

In [15]:
sing = pd.read_csv("singers.csv")
sing

            Artist                      Album  Released    Length
0  Michael Jackson                   Thriller      1982  00:42:19
1            AC/DC              Back in Black      1980  00:42:11
2       Pink Floyd  The Dark Side of the Moon      1973  00:42:49
3  Whitney Houston              The Bodyguard      1992  00:57:44
4        Meat Loaf            Bat Out of Hell      1977  00:46:33

## JSON

In [19]:
import json

In [20]:
with open("userss.json","r", encoding = "UTF-8") as us:
     data = json.load(us) 
data

[{'nombre': 'Daniel', 'email': 'daniel@example.com', 'edad': 23},
 {'nombre': 'Lucia', 'email': 'lucia@example.com', 'edad': 30},
 {'nombre': 'Pedro', 'email': 'pedro@example.com', 'edad': 28}]

In [24]:
data[0:2]

[{'nombre': 'Daniel', 'email': 'daniel@example.com', 'edad': 23},
 {'nombre': 'Lucia', 'email': 'lucia@example.com', 'edad': 30}]

In [28]:
df = pd.DataFrame(data)
df

   nombre               email  edad
0  Daniel  daniel@example.com    23
1   Lucia   lucia@example.com    30
2   Pedro   pedro@example.com    28

## XML

In [29]:
import xml.etree.ElementTree as etree

In [31]:
tree = etree.parse("employees.xml")
root = tree.getroot()

In [33]:
rows = []

In [34]:
for node in root:
    name = node.find("name").text
    role = node.find("role").text
    salary = node.find("salary").text
    rows.append([name, role, salary])

In [35]:
df = pd.DataFrame(rows, columns=["name", "role", "salary"])
df

     name           role salary
0  Daniel   Data Analyst  28000
1   Lucia  Data Engineer  35000
2   Pedro   BI Developer  32000